Repository: ogomez92/GemVDA
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, it, pt, uk

source: M&odel:
uk: &Модель:

source: S&ystem prompt:
es: Indicación del s&istema:
it: Prompt di s&istema:
pt: Prompt do s&istema:
uk: &Системна підказка:

source: &Messages:
uk: &Повідомлення:

source: &Prompt:
uk: &Запит:

source: &Send
es: &Enviar
it: &Invia
pt: &Enviar
uk: &Надіслати

source: Attach &Image...
es: Adjuntar &imagen...
it: Allega &immagine...
pt: Anexar &imagem...
uk: Додати &зображення...

source: Attach &Video...
uk: Додати &відео...

source: &Clear
es: &Limpiar
it: &Pulisci
pt: &Limpar
uk: &Очистити

source: C&opy Response
es: C&opiar respuesta
it: C&opia risposta
pt: C&opiar resposta
uk: С&копіювати відповідь

source: Close
es: Cerrar
it: Chiudi
pt: Fechar
uk: Закрити

source: You
es: Tú
it: Tu
pt: Voce
uk: Ви

source: No messages in history
uk: Немає повідомлень в історії

source: Message {num} not available. Only {total} message(s) in history.
uk: Повідомлення {num} недоступне. В історії є тільки {total} повідомлень.

source: Message {num} is empty
uk: Повідомлення {num} порожнє

source: No messages to copy
uk: Немає повідомлень для копіювання

source: Message {num} copied to clipboard
uk: Повідомлення {num} скопійовано в буфер обміну

source: Message {num} is empty, nothing to copy
uk: Повідомлення {num} порожнє, нема що копіювати

source: Uploading videos...
uk: Відвантаження відео...

source: Error: {error}
it: Errore: {error}
pt: Erro: {error}
uk: Помилка: {error}

source: {count} image(s)
uk: {count} зображень

source: {count} video(s)
uk: {count} відео

source: Select Image
es: Seleccionar imagen
it: Seleziona immagine
pt: Selecionar imagem
uk: Вибрати Зображення

source: Image files (*.png;*.jpg;*.jpeg;*.gif;*.webp)|*.png;*.jpg;*.jpeg;*.gif;*.webp
es: Archivos de imagen (*.png;*.jpg;*.jpeg;*.gif;*.webp)|*.png;*.jpg;*.jpeg;*.gif;*.webp
it: File immagine (*.png;*.jpg;*.jpeg;*.gif;*.webp)|*.png;*.jpg;*.jpeg;*.gif;*.webp
pt: Arquivos de imagem (*.png;*.jpg;*.jpeg;*.gif;*.webp)|*.png;*.jpg;*.jpeg;*.gif;*.webp
uk: Файли зображень (*.png;*.jpg;*.jpeg;*.gif;*.webp)|*.png;*.jpg;*.jpeg;*.gif;*.webp

source: Select Video
uk: Вибрати Відео

source: Video files ({ext})|{ext}
uk: Відеофайли ({ext})|{ext}

source: {count} video(s) uploaded
uk: Відвантажено {count} відео

source: attached
uk: додано

source: Video upload failed: {path}
uk: Помилка завантаження відео: {path}

source: Video upload failed: {error}
uk: Помилка відвантаження відео: {error}

source: Conversation cleared
es: Conversación limpiada
it: Conversazione cancellata
pt: Conversa limpa
uk: Бесіду видалено

source: Response copied to clipboard
es: Respuesta copiada al portapapeles
it: Risposta copiata negli appunti
pt: Resposta copiada para a area de transferencia
uk: Відповідь скопійовано в буфер обміну

source: No response to copy
es: No hay respuesta para copiar
it: Nessuna risposta da copiare
pt: Nenhuma resposta para copiar
uk: Немає відповіді для копіювання

source: Gemini API Key
es: Clave API de Gemini
it: Chiave API Gemini
pt: Chave API Gemini
uk: Ключ Gemini API

source: Enter your Gemini API key. Get one at: https://aistudio.google.com/apikey
es: Introduce tu clave API de Gemini. Obtener una en: https://aistudio.google.com/apikey
it: Inserisci la tua chiave API Gemini. Ottienine una su: https://aistudio.google.com/apikey
pt: Digite sua chave API Gemini. Obtenha uma em: https://aistudio.google.com/apikey
uk: Введіть ключ Gemini API. Отримайте його за адресою: https://aistudio.google.com/apikey

source: Current key source: {source}
es: Fuente de clave actual: {source}
it: Fonte chiave attuale: {source}
pt: Fonte da chave atual: {source}
uk: Поточне джерело ключа: {source}

source: API &Key:
es: &Clave API:
it: &Chiave API:
pt: &Chave API:
uk: &Ключ API:

source: &Delete Key
es: &Eliminar clave
it: &Elimina chiave
pt: &Excluir chave
uk: &Видалити ключ

source: API key saved
es: Clave API guardada
it: Chiave API salvata
pt: Chave API salva
uk: Ключ API збережено

source: Failed to save API key
es: Error al guardar la clave API
it: Errore nel salvare la chiave API
pt: Falha ao salvar chave API
uk: Не вдалося зберегти ключ API

source: API key deleted
es: Clave API eliminada
it: Chiave API eliminata
pt: Chave API excluida
uk: Ключ API видалено

source: Failed to delete API key
es: Error al eliminar la clave API
it: Errore nell'eliminare la chiave API
pt: Falha ao excluir chave API
uk: Не вдалося видалити ключ API

source: Configure API &Key...
es: Configurar &clave API...
it: Configura &chiave API...
pt: Configurar &chave API...
uk: Налаштувати &ключ API...

source: Default &model:
es: &Modelo predeterminado:
it: &Modello predefinito:
pt: &Modelo padrao:
uk: &Початкова модель:

source: &Temperature (0-200):
es: &Temperatura (0-200):
it: &Temperatura (0-200):
pt: &Temperatura (0-200):
uk: &Температура (0-200):

source: Ma&x output tokens:
es: Tokens má&ximos de salida:
it: Token di output ma&x:
pt: Tokens de saida ma&x:
uk: &Максимальна кількість токенів на виході:

source: &Stream responses
es: &Transmitir respuestas
it: Risposte in &streaming
pt: &Transmitir respostas
uk: &Потокова передача відповідей

source: &Conversation mode (include history)
es: Modo &conversación (incluir historial)
it: Modalita &conversazione (includi cronologia)
pt: Modo &conversa (incluir historico)
uk: &Режим розмови (включно з історією)

source: &Remember system prompt
es: &Recordar indicación del sistema
it: &Ricorda prompt di sistema
pt: &Lembrar prompt do sistema
uk: &Запам'ятати системну підказку

source: &Block Escape key in dialog
es: &Bloquear tecla Escape en el diálogo
it: &Blocca tasto Escape nella finestra
pt: &Bloquear tecla Escape no dialogo
uk: &Блокувати клавішу Escape у діалозі

source: &Filter markdown from responses
es: &Filtrar markdown de las respuestas
it: &Filtra markdown dalle risposte
pt: &Filtrar markdown das respostas
uk: &Фільтрувати markdown з відповідей

source: &Video analysis prompt:
es: Prompt de &análisis de video:
pt: Prompt de análise de &vídeo:
uk: Підказка для аналізу &відео:

source: Describe this video in detail, but concise. Get as much information as you can and if there is any important text in the video read it.
es: Describe este video en detalle, pero de forma concisa. Obtén toda la información que puedas y si hay algún texto importante en el video, léelo.
pt: Descreva este video em detalhe, mas de forma concisa. Obtenha o maximo de informacao possivel e se houver algum texto importante no video, leia-o.
uk: Опиши це відео детально, але лаконічно. Збери якомога більше інформації та, якщо у відео є важливий текст, прочитай його.

source: S&ummarize selection prompt:
es: Prompt de res&umen de selección:
pt: Prompt de res&umo de selecao:
uk: &Підсумувати вибране:

source: Summarize the key points of the following text in a clear and concise manner:
es: Resume los puntos clave del siguiente texto de forma clara y concisa:
pt: Resuma os pontos principais do texto a seguir de forma clara e concisa:
uk: Підсумуй ключові моменти наведеного нижче тексту в чіткій і стислій формі:

source: Sound Feedback
es: Retroalimentación sonora
it: Feedback sonoro
pt: Feedback sonoro
uk: Звуковий відгук

source: Play sound when request &sent
es: Reproducir sonido al &enviar solicitud
it: Riproduci suono all'&invio richiesta
pt: Tocar som ao &enviar solicitacao
uk: Відтворювати звук під час &надсилання запиту

source: Play sound while &waiting
es: Reproducir sonido mientras &espera
it: Riproduci suono durante l'&attesa
pt: Tocar som enquanto &aguarda
uk: Відтворювати звук під час &очікування

source: Play sound when response &received
es: Reproducir sonido al &recibir respuesta
it: Riproduci suono alla &ricezione risposta
pt: Tocar som ao &receber resposta
uk: Відтворювати звук &при отриманні відповіді

source: Open Gemini &Dialog... NVDA+G
es: Abrir &diálogo de Gemini... NVDA+G
it: Apri &finestra Gemini... NVDA+G
pt: Abrir &dialogo Gemini... NVDA+G
uk: Відкрити &Діалог Gemini... NVDA+G

source: &Settings...
es: &Opciones...
it: &Impostazioni...
pt: &Configuracoes...
uk: &Налаштування...

source: Get &API Key (web)...
es: Obtener clave &API (web)...
it: Ottieni chiave &API (web)...
pt: Obter chave &API (web)...
uk: Отримати &ключ API (веб)...

source: Google GenAI library not installed. Please run install_deps.py in the add-on folder.
es: Biblioteca Google GenAI no instalada. Por favor ejecuta install_deps.py en la carpeta del complemento.
it: Libreria Google GenAI non installata. Esegui install_deps.py nella cartella dell'addon.
pt: Biblioteca Google GenAI nao instalada. Execute install_deps.py na pasta do complemento.
uk: Бібліотека Google GenAI не встановлена. Запустіть install_deps.py у папці додатка.

source: Show Gemini AI dialog
es: Mostrar diálogo de Gemini AI
it: Mostra finestra Gemini AI
pt: Mostrar dialogo Gemini AI
uk: Показати діалог Gemini AI

source: Describe the entire screen using Gemini
es: Describir la pantalla completa usando Gemini
it: Descrivi l'intero schermo usando Gemini
pt: Descrever a tela inteira usando Gemini
uk: Описати весь екран за допомогою Gemini

source: Google GenAI library not installed.
uk: Бібліотека Google GenAI не встановлена.

source: Capturing screen...
es: Capturando pantalla...
it: Cattura schermo...
pt: Capturando tela...
uk: Знімок екрана...

source: Failed to capture screenshot
es: Error al capturar pantalla
it: Errore nella cattura schermo
pt: Falha ao capturar tela
uk: Не вдалося зробити знімок екрана

source: Describe the navigator object using Gemini
es: Describir el objeto del navegador usando Gemini
it: Descrivi l'oggetto del navigatore usando Gemini
pt: Descrever o objeto do navegador usando Gemini
uk: Описати об'єкт навігатора за допомогою Gemini

source: Capturing object...
es: Capturando objeto...
it: Cattura oggetto...
pt: Capturando objeto...
uk: Знімок об'єкта...

source: Failed to capture object
es: Error al capturar objeto
it: Errore nella cattura oggetto
pt: Falha ao capturar objeto
uk: Не вдалося зробити знімок об’єкта

source: Uploading video...
es: Subiendo video...
it: Caricamento video...
pt: Enviando video...
uk: Відвантаження відео...

source: Video processing failed
es: Error al procesar video
it: Elaborazione video fallita
pt: Processamento de video falhou
uk: Помилка обробки відео

source: Analyzing video...
es: Analizando video...
it: Analisi video...
pt: Analisando video...
uk: Аналіз відео...

source: No response from AI
es: Sin respuesta de la IA
pt: Sem resposta da IA
uk: Немає відповіді від ШІ

source: Video analysis failed: {error}
es: Error en análisis de video: {error}
it: Analisi video fallita: {error}
pt: Analise de video falhou: {error}
uk: Помилка аналізу відео: {error}

source: Start or stop video recording for Gemini analysis
es: Iniciar o detener grabación de video para análisis de Gemini
it: Avvia o ferma registrazione video per analisi Gemini
pt: Iniciar ou parar gravacao de video para analise Gemini
uk: Почати або зупинити запис відео для аналізу Gemini

source: Video capture not available. Missing dependencies.
es: Captura de video no disponible. Faltan dependencias.
it: Cattura video non disponibile. Dipendenze mancanti.
pt: Captura de video nao disponivel. Dependencias faltando.
uk: Запис відео недоступний. Відсутні залежності.

source: Stopping recording...
es: Deteniendo grabación...
it: Arresto registrazione...
pt: Parando gravacao...
uk: Зупинити запис...

source: Video saved. Sending to Gemini for analysis...
es: Video guardado. Enviando a Gemini para análisis...
it: Video salvato. Invio a Gemini per analisi...
pt: Video salvo. Enviando para Gemini para analise...
uk: Відео збережено. Відправлення в Gemini для аналізу...

source: Failed to save video
es: Error al guardar video
it: Errore nel salvare il video
pt: Falha ao salvar video
uk: Не вдалося зберегти відео

source: Recording started. Press NVDA+V again to stop.
es: Grabación iniciada. Presiona NVDA+V de nuevo para detener.
it: Registrazione avviata. Premi di nuovo NVDA+V per fermare.
pt: Gravacao iniciada. Pressione NVDA+V novamente para parar.
uk: Запис розпочато. Щоб зупинити, знову натисніть NVDA+V.

source: Failed to start recording
es: Error al iniciar grabación
it: Errore nell'avviare la registrazione
pt: Falha ao iniciar gravacao
uk: Не вдалося розпочати запис

source: Summarize selected text using Gemini
es: Resumir texto seleccionado usando Gemini
pt: Resumir texto selecionado usando Gemini
uk: Підсумувати вибраний текст за допомогою Gemini

source: No text selected
es: No hay texto seleccionado
pt: Nenhum texto selecionado
uk: Текст не вибрано

source: Summarizing...
es: Resumiendo...
pt: Resumindo...
uk: Підсумок...

source: Summarization failed: {error}
es: Error al resumir: {error}
pt: Falha ao resumir: {error}
uk: Помилка підсумовування: {error}

source: Comprehensive Google Gemini AI capabilities integrated into NVDA. Supports Gemini 3, Gemini 2.5 Pro, Flash, and other models for chat, image description, and more.
uk: Повна інтеграція можливостей Google Gemini AI в NVDA. Підтримуються Gemini 3, Gemini 2.5 Pro, Flash та інші моделі для чатів, опису зображень тощо.

source: Initial release with Gemini AI integration.
uk: Початковий випуск з інтеграцією Gemini AI.

source: &Model:
es: &Modelo:
it: &Modello:
pt: &Modelo:

source: &History:
es: &Historial:
it: &Cronologia:
pt: &Historico:

source: &Message:
es: &Mensaje:
it: &Messaggio:
pt: &Mensagem:

source: [{count} image(s)] {text}
es: [{count} imagen(es)] {text}
it: [{count} immagine/i] {text}
pt: [{count} imagem(ns)] {text}

source: {count} image(s) attached
es: {count} imagen(es) adjuntada(s)
it: {count} immagine/i allegata/e
pt: {count} imagem(ns) anexada(s)

source: No Gemini API key configured. Please add your API key in the settings.
es: No hay clave API de Gemini configurada. Por favor agrega tu clave API en las opciones.
it: Nessuna chiave API Gemini configurata. Aggiungi la tua chiave API nelle impostazioni.
pt: Nenhuma chave API Gemini configurada. Adicione sua chave API nas configuracoes.
